trailcurrentoss/TrailCurrentSpotter/sdkconfig.defaults
# Target: ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Flash (16MB on Waveshare ESP32-S3-Touch-LCD-4.3C)
# Flash core clock must match PSRAM core clock (ESP-IDF static assert in
# mspi_timing_tuning_configs.h). PSRAM dropped from 120→80 MHz for thermal
# stability, so flash follows to 80 MHz.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM (8MB OPI, 80MHz — mainline-supported speed. 120MHz was experimental
# (CONFIG_IDF_EXPERIMENTAL_FEATURES) and Espressif's own docs warn it is not
# high-temperature stable — PSRAM/flash accesses can fail randomly after die
# temp drifts >~20°C from boot. This manifested on Spotter as long-run RGB
# LCD flicker (bounce-buffer refills reading corrupt PSRAM) that only
# cleared with a power cycle.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y


# Compiler optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Pin the ESP-IDF "main" task (which runs app_main + our LVGL loop) to CPU1.
# Two consequences:
#   1. esp_lcd_new_rgb_panel + GDMA channel allocations happen on CPU1, so the
#      RGB refill / GDMA ISRs run on CPU1 too. That takes them off CPU0 where
#      the WiFi driver task lives by default (ESP_WIFI_TASK_PINNED_TO_CORE_0),
#      so a WiFi burst can no longer starve the display bounce-refill ISR.
#   2. The LVGL loop itself runs on CPU1, away from the WiFi + system event
#      tasks. MQTT / WiFi event callbacks that need to touch the UI still
#      bounce onto the LVGL thread via lv_async_call in app_state.c — that
#      handoff is preserved on purpose.
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU1=y
# CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0 is not set
# CONFIG_ESP_MAIN_TASK_AFFINITY_NO_AFFINITY is not set

# System event loop task stack — default 2304 isn't enough for our WiFi event
# handlers (wifi_setup's on_scan_done has a 960-byte stack-allocated buffer of
# wifi_ap_record_t, plus the qsort + my app_state callbacks). FluidCNC pendant
# uses the same value.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=6144

# WiFi — put the hot RX/TX paths in IRAM. Combined with the LCD/GDMA
# IRAM-safe ISRs below, this keeps the WiFi stack from stalling display
# interrupts during flash-cache-disable windows (every NVS commit is one),
# and keeps WiFi from stalling under the same windows itself.
CONFIG_ESP_WIFI_IRAM_OPT=y
CONFIG_ESP_WIFI_RX_IRAM_OPT=y

# RGB-panel latency hardening — root cause of long-run flicker on this
# device is bounce-buffer underrun: the per-chunk refill ISR misses its
# deadline because higher-priority code (WiFi/mbedTLS/flash-cache-disable)
# runs on the same core. Two flags together:
#
#   LCD_RGB_ISR_IRAM_SAFE + GDMA_ISR_IRAM_SAFE — the display + DMA ISRs run
#   even while flash cache is disabled (NVS commit, OTA write). Without
#   this every NVS write is a dice-roll on a visible flicker.
#
#   LCD_RGB_RESTART_IN_VSYNC — if an underrun does happen, restart the
#   frame from vsync so the glitch self-heals within one frame instead of
#   staying visible until the next full-screen redraw.
#
# The three together remove the mechanism, not the symptom. Bounce-buffer
# oversizing (SCREEN_WIDTH*20 in main/main.c lcd_init) was the symptom
# fix; with these on, that oversizing can eventually be pared back if
# soak testing shows zero flush timeouts.
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y
CONFIG_LCD_RGB_RESTART_IN_VSYNC=y
CONFIG_GDMA_ISR_IRAM_SAFE=y

# TLS for MQTT
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y

# mbedTLS — defeat heap fragmentation on TLS handshake.
#
# Spotter's internal RAM is heavily consumed by LVGL after ui_init() (~250 KB
# resident, fragmented into many small free blocks; largest contiguous = ~7 KB).
# mbedTLS's TLS handshake needs several KB contiguous PER allocation; with
# internal RAM that fragmented it can't even land a 2.7 KB request, so the
# handshake fails -0x7F00 (ALLOC_FAILED).
#
# Two-prong fix:
#   1. DYNAMIC_BUFFER — allocate only what each step needs, not the full
#      IN/OUT max-buffer pair, so smaller blocks satisfy more allocations.
#   2. EXTERNAL_MEM_ALLOC — route mbedTLS's heap to PSRAM (8 MB, contiguous,
#      barely used). Internal RAM stops being the constraint entirely.
#
# Both flags are safe together: dynamic-buffer controls SIZE, external-alloc
# controls WHERE. The combination is the documented Espressif recommendation
# for low-internal-RAM TLS scenarios.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_PEER_CERT=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=4096
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=2048
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# LVGL color settings
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_16_SWAP=n

# LVGL memory — route ALL widget allocations to PSRAM (see main/lv_mem_psram.c
# and the add_compile_definitions in the project CMakeLists.txt). Without this
# LVGL eats ~200 KB of internal RAM after ui_init() and fragments it into
# blocks too small for the mbedTLS handshake.
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEM_CUSTOM_INCLUDE="lv_mem_psram.h"
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_ATTRIBUTE_FAST_MEM=y

# LVGL HAL
CONFIG_LV_DISP_DEF_REFR_PERIOD=33
CONFIG_LV_INDEV_DEF_READ_PERIOD=15
CONFIG_LV_DPI_DEF=130

# LVGL drawing
CONFIG_LV_DRAW_COMPLEX=y

# LVGL logging
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y

# LVGL fonts — sizes used by the dashboard manifest:
#   8/10 → tire sub, lamp labels, captions, BREAKAWAY, "TIRE PSI - TARGET 65"
#   12/14 → status text, body labels, advisory text
#   18 → tire PSI numbers
#   22 → header speed value
#   36 → solar W value
#   40 → battery % value
# (16/24/32 retained for other screens; 14 is the LVGL default font.)
CONFIG_LV_FONT_MONTSERRAT_8=y
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y

# LVGL widgets
CONFIG_LV_USE_ARC=y
CONFIG_LV_USE_BAR=y
CONFIG_LV_USE_BTN=y
CONFIG_LV_USE_BTNMATRIX=y
CONFIG_LV_USE_CHECKBOX=y
CONFIG_LV_USE_DROPDOWN=y
CONFIG_LV_USE_IMG=y
CONFIG_LV_USE_LABEL=y
CONFIG_LV_USE_LINE=y
CONFIG_LV_USE_ROLLER=y
CONFIG_LV_USE_SLIDER=y
CONFIG_LV_USE_SWITCH=y
CONFIG_LV_USE_TEXTAREA=y
CONFIG_LV_USE_TABLE=y

# LVGL extra widgets
CONFIG_LV_USE_KEYBOARD=y
CONFIG_LV_USE_LED=y
CONFIG_LV_USE_LIST=y
CONFIG_LV_USE_METER=y
CONFIG_LV_USE_MSGBOX=y
CONFIG_LV_USE_SPINNER=y
CONFIG_LV_USE_TABVIEW=y

# LVGL themes
CONFIG_LV_USE_THEME_DEFAULT=y
CONFIG_LV_THEME_DEFAULT_DARK=n
CONFIG_LV_USE_THEME_BASIC=y

# LVGL layouts
CONFIG_LV_USE_FLEX=y
CONFIG_LV_USE_GRID=y

# LVGL perf/debug
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_USE_MEM_MONITOR=n
